UploadFileTest.jmx.yaml
---
execution:
- concurrency: 10
  hold-for: 5m  # time boundery to send all the request
  iterations: 10
  ramp-up: 50s  #delay before starting next vuser
  scenario: File Upload using REST API
scenarios:
  File Upload using REST API:
  
    requests:
    - assert:
      - assume-success: false
        contains:
        - '"succeeded"'
        - '"failed":0'
        not: false
        regexp: false
        subject: body
      follow-redirects: true
      label: 'uploading '
      method: POST
      upload-files:
      - mime-type: text/csv
        param: fileData
        path: itbitEUR.csv  # file size 10MB
        #basic authorization setting
      headers:
        Authorization: Basic ${__base64Encode(${__P(user-auth)})}
      url: http://${host}:${port}/zoomdata/api/upload/${sourceId}?accountId=${accountId}
    store-cache: false
    store-cookie: false
    use-dns-cache-mgr: false
    variables:
      accountId: 5a2ef7a2e4b043bb0659cddf
      host: localhost
      port: '8080'
      sourceId: 5a4588ffe4b043bb5a947999

included-configs:  # it must be a list of string values
- config.yml  # to add local file just set its path

#generate test report of test result stat
reporting:
- module: console
- module: final-stats
  summary: true  # overall samples count and percent of failures
  percentiles: true  # display average times and percentiles
  failed-labels: false  # provides list of sample labels with failures
  test-duration: true  # provides test duration
  dump-csv: TaurusResult-10vu/perf_result_csv.csv
- module: junit-xml
  data-source: pass-fail
  criteria:
  - avg-rt of uploading>428000ms for 10s, stop as failed
  filename: TaurusResult-10vu/junit-result.xml
- module: blazemeter
  report-name: Taurus test report
  test: Taurus test
  project: Taurus test project

#specify the location of artifacts
settings:
  artifacts-dir: TaurusResult-10vu

#allocate enough RAM to jmeter to avoid Heap space OOM error
modules:
  jmeter:
    memory-xmx: 12G